Ran Plan for 6 projects:

1. dir: `live/non-prod/us-east-1/qa/mysql` workspace: `default`
1. dir: `live/non-prod/us-east-1/qa/webserver-cluster` workspace: `default`
1. dir: `live/non-prod/us-east-1/stage/mysql` workspace: `default`
1. dir: `live/non-prod/us-east-1/stage/webserver-cluster` workspace: `default`
1. dir: `live/prod/us-east-1/prod/mysql` workspace: `default`
1. dir: `live/prod/us-east-1/prod/webserver-cluster` workspace: `default`

### 1. dir: `live/non-prod/us-east-1/qa/mysql` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2021-09-16T10:38:29Z level=warning msg=No double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/modules/mysql. Relative paths in downloaded Terraform code may not work.

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "3.7.0"...
- Installing hashicorp/aws v3.7.0...
- Installed hashicorp/aws v3.7.0 (self-signed, key ID [0m[1m34365D9472D7468F[0m[0m)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
aws_db_instance.mysql: Refreshing state... [id=terraform-20210916082143644000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.mysql will be created
  + resource "aws_db_instance" "mysql" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.6.41"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + kms_key_id                            = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "mysql_qa"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + status                                = (known after apply)
      + storage_type                          = "standard"
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ arn      = "arn:aws:rds:us-east-1:021246677106:db:terraform-20210916082143644000000001" -> (known after apply)
  ~ endpoint = "terraform-20210916082143644000000001.csx8gf7mhmkj.us-east-1.rds.amazonaws.com:3306" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/non-prod/us-east-1/qa/mysql/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/non-prod/us-east-1/qa/mysql/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/non-prod/us-east-1/qa/mysql`
* :put_litter_in_its_place: To **delete** this plan click [here](http://174.129.59.157/lock?id=pkaramol%252Fterragrunt-infrastructure-live-example%252Flive%252Fnon-prod%252Fus-east-1%252Fqa%252Fmysql%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/non-prod/us-east-1/qa/mysql`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `live/non-prod/us-east-1/qa/webserver-cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2021-09-16T10:38:34Z level=warning msg=No double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/modules/asg-elb-service. Relative paths in downloaded Terraform code may not work.

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "3.7.0"...
- Installing hashicorp/aws v3.7.0...
- Installed hashicorp/aws v3.7.0 (self-signed, key ID [0m[1m34365D9472D7468F[0m[0m)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
aws_security_group.elb: Refreshing state... [id=sg-0f041235a13ce8cbc]
aws_security_group.asg: Refreshing state... [id=sg-0f6497ccc0d48a169]
aws_security_group_rule.elb_allow_http_inbound: Refreshing state... [id=sgrule-1806888229]
aws_security_group_rule.elb_allow_all_outbound: Refreshing state... [id=sgrule-2479375107]
aws_security_group_rule.asg_allow_http_inbound: Refreshing state... [id=sgrule-3689163639]
aws_launch_configuration.webserver_example: Refreshing state... [id=terraform-20210916082625112600000001]
aws_elb.webserver_example: Refreshing state... [id=webserver-example-qa]
aws_autoscaling_group.webserver_example: Refreshing state... [id=tf-asg-20210916082627226600000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.webserver_example will be created
  + resource "aws_autoscaling_group" "webserver_example" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = "terraform-20210916082625112600000001"
      + load_balancers            = [
          + "webserver-example-qa",
        ]
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-44521a18",
          + "subnet-84440eaa",
          + "subnet-941956f3",
          + "subnet-96000199",
          + "subnet-be0f10f4",
          + "subnet-fb5ccfc5",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "webserver-example-qa"
        }
    }

  # aws_elb.webserver_example will be created
  + resource "aws_elb" "webserver_example" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "webserver-example-qa"
      + security_groups             = [
          + "sg-0f041235a13ce8cbc",
        ]
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = [
          + "subnet-44521a18",
          + "subnet-84440eaa",
          + "subnet-941956f3",
          + "subnet-96000199",
          + "subnet-be0f10f4",
          + "subnet-fb5ccfc5",
        ]
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:8080/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 8080
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ asg_name     = "tf-asg-20210916082627226600000002" -> (known after apply)
  ~ elb_dns_name = "webserver-example-qa-1085581641.us-east-1.elb.amazonaws.com" -> (known after apply)
  ~ url          = "http://webserver-example-qa-1085581641.us-east-1.elb.amazonaws.com:80" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/non-prod/us-east-1/qa/webserver-cluster/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/non-prod/us-east-1/qa/webserver-cluster/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/non-prod/us-east-1/qa/webserver-cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://174.129.59.157/lock?id=pkaramol%252Fterragrunt-infrastructure-live-example%252Flive%252Fnon-prod%252Fus-east-1%252Fqa%252Fwebserver-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/non-prod/us-east-1/qa/webserver-cluster`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 3. dir: `live/non-prod/us-east-1/stage/mysql` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2021-09-16T10:38:39Z level=warning msg=No double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/modules/mysql. Relative paths in downloaded Terraform code may not work.

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "3.7.0"...
- Installing hashicorp/aws v3.7.0...
- Installed hashicorp/aws v3.7.0 (self-signed, key ID [0m[1m34365D9472D7468F[0m[0m)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
aws_db_instance.mysql: Refreshing state... [id=terraform-20210916082718825100000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.mysql will be created
  + resource "aws_db_instance" "mysql" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.6.41"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + kms_key_id                            = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "mysql_stage"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + status                                = (known after apply)
      + storage_type                          = "standard"
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ arn      = "arn:aws:rds:us-east-1:021246677106:db:terraform-20210916082718825100000001" -> (known after apply)
  ~ endpoint = "terraform-20210916082718825100000001.csx8gf7mhmkj.us-east-1.rds.amazonaws.com:3306" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/non-prod/us-east-1/stage/mysql/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/non-prod/us-east-1/stage/mysql/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/non-prod/us-east-1/stage/mysql`
* :put_litter_in_its_place: To **delete** this plan click [here](http://174.129.59.157/lock?id=pkaramol%252Fterragrunt-infrastructure-live-example%252Flive%252Fnon-prod%252Fus-east-1%252Fstage%252Fmysql%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/non-prod/us-east-1/stage/mysql`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 4. dir: `live/non-prod/us-east-1/stage/webserver-cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2021-09-16T10:38:44Z level=warning msg=No double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/modules/asg-elb-service. Relative paths in downloaded Terraform code may not work.

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v3.7.0...
- Installed hashicorp/aws v3.7.0 (self-signed, key ID [0m[1m34365D9472D7468F[0m[0m)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
aws_security_group.elb: Refreshing state... [id=sg-0b0a45f5d203e2a15]
aws_security_group.asg: Refreshing state... [id=sg-0319bd003fc2cd383]
aws_security_group_rule.elb_allow_http_inbound: Refreshing state... [id=sgrule-1566701153]
aws_security_group_rule.elb_allow_all_outbound: Refreshing state... [id=sgrule-1600569483]
aws_launch_configuration.webserver_example: Refreshing state... [id=terraform-20210916083237845200000001]
aws_security_group_rule.asg_allow_http_inbound: Refreshing state... [id=sgrule-2981362542]
aws_elb.webserver_example: Refreshing state... [id=webserver-example-stage]
aws_autoscaling_group.webserver_example: Refreshing state... [id=tf-asg-20210916083241007800000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.webserver_example will be created
  + resource "aws_autoscaling_group" "webserver_example" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = "terraform-20210916083237845200000001"
      + load_balancers            = [
          + "webserver-example-stage",
        ]
      + max_size                  = 0
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-44521a18",
          + "subnet-84440eaa",
          + "subnet-941956f3",
          + "subnet-96000199",
          + "subnet-be0f10f4",
          + "subnet-fb5ccfc5",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "webserver-example-stage"
        }
    }

  # aws_elb.webserver_example will be created
  + resource "aws_elb" "webserver_example" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "webserver-example-stage"
      + security_groups             = [
          + "sg-0b0a45f5d203e2a15",
        ]
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = [
          + "subnet-44521a18",
          + "subnet-84440eaa",
          + "subnet-941956f3",
          + "subnet-96000199",
          + "subnet-be0f10f4",
          + "subnet-fb5ccfc5",
        ]
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:8080/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 8080
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ asg_name     = "tf-asg-20210916083241007800000002" -> (known after apply)
  ~ elb_dns_name = "webserver-example-stage-92699602.us-east-1.elb.amazonaws.com" -> (known after apply)
  ~ url          = "http://webserver-example-stage-92699602.us-east-1.elb.amazonaws.com:80" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/non-prod/us-east-1/stage/webserver-cluster/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/non-prod/us-east-1/stage/webserver-cluster/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/non-prod/us-east-1/stage/webserver-cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://174.129.59.157/lock?id=pkaramol%252Fterragrunt-infrastructure-live-example%252Flive%252Fnon-prod%252Fus-east-1%252Fstage%252Fwebserver-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/non-prod/us-east-1/stage/webserver-cluster`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 5. dir: `live/prod/us-east-1/prod/mysql` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2021-09-16T10:38:51Z level=warning msg=No double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/modules/mysql. Relative paths in downloaded Terraform code may not work.

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v3.7.0...
- Installed hashicorp/aws v3.7.0 (self-signed, key ID [0m[1m34365D9472D7468F[0m[0m)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
aws_db_instance.mysql: Refreshing state... [id=terraform-20210916083401708100000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.mysql will be created
  + resource "aws_db_instance" "mysql" {
      + address                               = (known after apply)
      + allocated_storage                     = 100
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.6.41"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.medium"
      + kms_key_id                            = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "mysql_prod"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + status                                = (known after apply)
      + storage_type                          = "standard"
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ arn      = "arn:aws:rds:us-east-1:021246677106:db:terraform-20210916083401708100000001" -> (known after apply)
  ~ endpoint = "terraform-20210916083401708100000001.csx8gf7mhmkj.us-east-1.rds.amazonaws.com:3306" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/prod/us-east-1/prod/mysql/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/prod/us-east-1/prod/mysql/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/prod/us-east-1/prod/mysql`
* :put_litter_in_its_place: To **delete** this plan click [here](http://174.129.59.157/lock?id=pkaramol%252Fterragrunt-infrastructure-live-example%252Flive%252Fprod%252Fus-east-1%252Fprod%252Fmysql%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/prod/us-east-1/prod/mysql`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 6. dir: `live/prod/us-east-1/prod/webserver-cluster` workspace: `default`
**Plan Error**
```
exit status 1: running "terragrunt plan -no-color -out --terragrunt-non-interactive $PLANFILE" in "/home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/prod/us-east-1/prod/webserver-cluster": 
time=2021-09-16T10:38:57Z level=error msg=/home/ubuntu/.atlantis/repos/pkaramol/terragrunt-infrastructure-live-example/4/default/live/prod/us-east-1/prod/webserver-cluster/terragrunt.hcl:26,14-27,1: Invalid expression; Expected the start of an expression, but found an invalid expression token.
time=2021-09-16T10:38:57Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
